"""
Завдання 2
макс 30 балів
дано код Морзе, що зберігається в словнику
є стрічка, в якій слова розділені 2 пробілами, а букви в слові - одним пробілом
написати програму по декодуванню даної (чи подібної) стрічки
ПІДКАЗКА - при потребі можна створити симетричний словник, де ключами буде код Морзе, а значеннями - символи латиниці
"""
MORSE_CODE_DICT = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
    'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
    'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....',
    '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----', ', ': '--..--', '.': '.-.-.-',
    '?': '..--..', '/': '-..-.', '-': '-....-', '(': '-.--.', ')': '-.--.-'
}

string_to_decode1 = '..  .-.. .. -.- .  .--. -.-- - .... --- -.  ...-- .-.-.- .---- ----- '
string_to_decode2 = '..  -.- -. --- .-- --..--  -.-- --- ..-  -.-. .- -.  -.. ---  .. - '

MIRROR_MORSE_CODE_DICT = {v:k for k, v in MORSE_CODE_DICT.items()}
print(MIRROR_MORSE_CODE_DICT)
result = ''
for word in string_to_decode1.split('  '):
    for letter in word.split():
        result += MIRROR_MORSE_CODE_DICT[letter]
    result += ' '
print(result)