"""
Завдання 3
макс 50 балів
зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку
здійснюється за механізмом
student[outer_dict_key][inner_dict_key]

Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення,
    бал від 0 до 100 (інт чи флоат)
2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
    сам формат наповнення цього списку up to you
3 - визначити середній бал по групі
4 - при відсутності номеру телефону у студента записати номер деканату як значення за замовчуванням (номер на ваш вибір)

не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
"""
students = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 21,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 22,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}

################################################
print('1.')
print()
print()
students['Тимошенко Данііл'] = {
        'Пошта': 'Dan@gmail.com',
        'Вік': 18,
        'Номер телефону': None,
        'Середній бал': 91.8
    }
from pprint import pprint
pprint(students)
print()

print('*' * 99)

print('2.')
print()


for student in students:
    if students[student]['Середній бал'] > 90:
        print(student,'cр.бал.', students[student]['Середній бал'])

print('*' * 99)
print('3.')
print()


num_of_students = len(students)
accumulated_ball = 0
for student in students:
    accumulated_ball += students[student].setdefault('Середній бал', 0)

print('Cередній бал групи:', accumulated_ball/num_of_students)


print('*' * 99)
print('4.')
print()

for student in students:
    if not students[student]['Номер телефону']:
        students[student]['Номер телефону'] = '+3809711111110'
pprint(students)
# 2-ому студенту присвоїв новий номер замість None




